class Data {
   
  static List<String> JobPosition = [
    "طالب" , "مهندس" , "طالب علم" , "معلم" ,  "موظف حكومي" , "ربة بيت" , "متسيب" , "تاجر", "موظف أهلي" , "طبيب" , "ممرض" , "غير ذلك" 
  ];

  static List<String> social = [
    "متزوج" , "أعزب" , "مطلق"
  ];

  static List<String> address = [
"القديح" , "القطيف" , "صفوى" , "سيهات" , "العوامية" , "الجاودية" , "الجش" , "الأجوام" , "تاروت" , "أخرى"
  ];

  
  static List<String> gendre = [
    "ذكر",
    "أنثى",
  ];

  static List<String> trips = ['المدينة و مكة' ,'مكة فقط ' ];
  
  

  static List<String> typeAlhajj = [
 "حج واجب (أحج لأول مرة )",
 "حج مستحب (حججت مسبقا)",
 "حج نيابي (أحج نيابة عن غير )",
 "تاروت",
 "عما في الذمة (أحج لبراءة ذمتي)",
  ];
  static List<String> reference = ['الشيخ السيستاني',
  "الشيخ الخوئي ", 
  "ألشيخ الوحيد ",
  "السيد الخامنئي",
  "السيد الحكيم",
  "السيد صادق الشيرازي ",
  "الشيخ الفياض",
  "الشيخ العصفور",
  "الشيخ أمين زين الدين" ,
  "الشيخ المدرسي "
  ];
  static List<String> meansJourney = ['طيران ذهاب و عودة ' ,
  "ذهاب (طيران ) و العودة (حافلة)" ,
  "ذهاب (حافلة) و العودة (طيران)" ,
  "حافلة ذهاب و عودة "
  ];
  static List<List<String>> Lists = [
     
  ["حج واجب  ( أحج لأول مرة )" , "حج مستحب ( حججت مسبقا )" , "حج نيابي ( أحج نيابة عن غير )" , "عما في الذمة ( أحج لبراءة ذمتي )" , "تاروت"],
  // [ "الشيخ السيستاني" , "الشيخ الوحيد" , "السيد الخامنئي" , "السيد الجكيم" , "السيد صادق الشيرازي" , "الشيخ الفياض" , "الشيخ العصفور" , "الشيخ أمين زين الدين" , 'الشيخ المدرسي'],
 
  ["طيران ذهاب وعودة" , "ذهاب (طيران) والعودة (حافلة)" , "ذهاب (حافلة) والعودة (طيران)" , "حافلة ذهاب وعودة"],
  ];
 

 

  static List<String> bloodType = ["A+", "A-", "B+", "B-", "AB-", "AB+", "O+", "O-"];

  static List<String> ans = ["نعم", "لا"];

  static List<String> titles = [
    "الاسم الأول",
    "اسم الأب",
    "الاسم الجد",
    " العائلة", 
    " الإيميل",
    "رقم الهوية", 
  ];

  static List<String> hintTitles = [
    " ادخل اسمك الأول",
    " ادخل اسم الأب",
    "ادخل اسم الجد ",
    " ادخل اسم عائلتك",
    // " ادخل رقم جوالك",
    "  myemail@gmail.com",
    " ادخل رقم هويتك",
    // "ادخل تاريخ ميلادك  yyyy-mm-dd",
  ];

  static List<String> titles2 = [
    "نوع الحجة",
    // "مرجع التقليد", 
    
    "وسيلة الرحلة",
  ];

  static List<String> dropHints = [
    "اختر نوع الحجة",
    // "مرجع التقليد", 
    
    "اختر و سيلة الرحلة",
  ]; 

  static List<String> titles3 = [
    " فصيلة الدم",
    " هل لديك أمراض مزمنة",
    " هل تحتاج لمن يساعدك أثناء الطواف",
    "   هل تحتاج لمن يساعدك أثناء السعي",
    " هل تحتاج إلى كرسي متحرك",
  ];

  static List<String> dropHints2 = [
    "اختر فصيلة دمك",
    "نعم",
    "نعم",
    "نعم",
    "نعم",
  ];

  }